{"input": "Jennifer woke up at 8am.\nLisa saw Jennifer buying clothes at the mall from 8am to 9am.\nSteven saw Jennifer walking towards the Statue of Liberty from 9am to 10am.\nSarah saw Jennifer sitting on a rooftop from 10am to 2pm.\nLinda saw Jennifer taking photos near the Leaning Tower of Pisa from 4pm to 6pm.\nAndrew saw Jennifer working out at the gym from 6pm to 8pm.\nThe art show was closed after 8pm.\nBetween what times could Jennifer have gone to the art show?\nOptions:\n(A) 2pm to 4pm\n(B) 8am to 9am\n(C) 9am to 10am\n(D) 6pm to 8pm", "target": "(A)"}
{"input": "William woke up at 9am.\nLinda saw William playing tennis at the tennis court from 9am to 11am.\nEmily saw William attending class at the school from 11am to 1pm.\nNancy saw William walking in the garden from 6pm to 7pm.\nThe coffee shop was closed after 7pm.\nBetween what times could William have gone to the coffee shop?\nOptions:\n(A) 6pm to 7pm\n(B) 9am to 11am\n(C) 11am to 1pm\n(D) 1pm to 6pm", "target": "(D)"}
{"input": "Ashley woke up at 7am.\nLeslie saw Ashley buying a bike at the bike shop from 11am to 12pm.\nSusan saw Ashley working out at the gym from 12pm to 4pm.\nElizabeth saw Ashley waiting at the train station from 4pm to 7pm.\nEmily saw Ashley taking photos near the Leaning Tower of Pisa from 7pm to 9pm.\nThe bookstore was closed after 9pm.\nBetween what times could Ashley have gone to the bookstore?\nOptions:\n(A) 7pm to 9pm\n(B) 11am to 12pm\n(C) 12pm to 4pm\n(D) 7am to 11am", "target": "(D)"}
{"input": "Sarah woke up at 5am.\nAshley saw Sarah taking photos near the Eiffel Tower from 5am to 11am.\nMichael saw Sarah walking in the garden from 11am to 12pm.\nEmily saw Sarah buying cookies at a bakery from 12pm to 2pm.\nRichard saw Sarah buying a phone at the electronics store from 2pm to 3pm.\nThe clothing store was closed after 7pm.\nBetween what times could Sarah have gone to the clothing store?\nOptions:\n(A) 3pm to 7pm\n(B) 2pm to 3pm\n(C) 12pm to 2pm\n(D) 11am to 12pm", "target": "(A)"}
{"input": "Susan woke up at 5am.\nAnthony saw Susan waiting at the train station from 5am to 8am.\nJames saw Susan watching a movie at the theater from 11am to 5pm.\nMary saw Susan sitting on a rooftop from 5pm to 9pm.\nThe amusement park was closed after 9pm.\nBetween what times could Susan have gone to the amusement park?\nOptions:\n(A) 8am to 11am\n(B) 5am to 8am\n(C) 5pm to 9pm\n(D) 11am to 5pm", "target": "(A)"}
{"input": "Andrew woke up at 8am.\nThomas saw Andrew playing tennis at the tennis court from 8am to 11am.\nMary saw Andrew reading at the library from 11am to 1pm.\nMichael saw Andrew fixing their computer at the electronic store from 8pm to 10pm.\nThe dance studio was closed after 10pm.\nBetween what times could Andrew have gone to the dance studio?\nOptions:\n(A) 8pm to 10pm\n(B) 11am to 1pm\n(C) 8am to 11am\n(D) 1pm to 8pm", "target": "(D)"}
{"input": "Michael woke up at 10am.\nJohn saw Michael taking photos near the Eiffel Tower from 12pm to 2pm.\nSamantha saw Michael watching a movie at the theater from 2pm to 4pm.\nThomas saw Michael sitting on a rooftop from 4pm to 8pm.\nThe football field was closed after 8pm.\nBetween what times could Michael have gone to the football field?\nOptions:\n(A) 12pm to 2pm\n(B) 10am to 12pm\n(C) 2pm to 4pm\n(D) 4pm to 8pm", "target": "(B)"}
{"input": "David woke up at 5am.\nBetty saw David playing tennis at the tennis court from 5am to 8am.\nAnthony saw David walking towards the Statue of Liberty from 8am to 11am.\nLisa saw David taking photos near the Eiffel Tower from 12pm to 5pm.\nThe dance studio was closed after 5pm.\nBetween what times could David have gone to the dance studio?\nOptions:\n(A) 12pm to 5pm\n(B) 11am to 12pm\n(C) 5am to 8am\n(D) 8am to 11am", "target": "(B)"}
{"input": "Ashley woke up at 5am.\nNancy saw Ashley buying cookies at a bakery from 6am to 7am.\nDavid saw Ashley working at the office from 7am to 1pm.\nTiffany saw Ashley buying a phone at the electronics store from 1pm to 3pm.\nMary saw Ashley getting a coffee at the cafe from 3pm to 4pm.\nLisa saw Ashley buying lunch at the deli from 4pm to 10pm.\nThe gas station was closed after 10pm.\nBetween what times could Ashley have gone to the gas station?\nOptions:\n(A) 3pm to 4pm\n(B) 6am to 7am\n(C) 7am to 1pm\n(D) 5am to 6am", "target": "(D)"}
{"input": "David woke up at 7am.\nMichael saw David waiting at the train station from 7am to 12pm.\nThomas saw David sitting on a rooftop from 12pm to 2pm.\nTiffany saw David getting a coffee at the cafe from 2pm to 3pm.\nJames saw David fixing their computer at the electronic store from 3pm to 5pm.\nMark saw David reading at the library from 5pm to 6pm.\nThe gas station was closed after 8pm.\nBetween what times could David have gone to the gas station?\nOptions:\n(A) 2pm to 3pm\n(B) 6pm to 8pm\n(C) 5pm to 6pm\n(D) 7am to 12pm", "target": "(B)"}
{"input": "Anthony woke up at 7am.\nDavid saw Anthony working at the office from 7am to 8am.\nLeslie saw Anthony getting a coffee at the cafe from 8am to 11am.\nSarah saw Anthony watching a movie at the theater from 1pm to 9pm.\nThe bookstore was closed after 9pm.\nBetween what times could Anthony have gone to the bookstore?\nOptions:\n(A) 11am to 1pm\n(B) 8am to 11am\n(C) 7am to 8am\n(D) 1pm to 9pm", "target": "(A)"}
{"input": "Lisa woke up at 10am.\nLisa saw Lisa driving to the water park from 12pm to 2pm.\nHannah saw Lisa waiting at the airport from 2pm to 3pm.\nThomas saw Lisa buying a phone at the electronics store from 3pm to 4pm.\nThe art show was closed after 4pm.\nBetween what times could Lisa have gone to the art show?\nOptions:\n(A) 3pm to 4pm\n(B) 12pm to 2pm\n(C) 10am to 12pm\n(D) 2pm to 3pm", "target": "(C)"}
{"input": "Elizabeth woke up at 5am.\nBetty saw Elizabeth playing tennis at the tennis court from 5am to 9am.\nThomas saw Elizabeth waiting at the airport from 9am to 10am.\nTiffany saw Elizabeth buying a bike at the bike shop from 10am to 2pm.\nSteven saw Elizabeth working at the office from 2pm to 4pm.\nJohn saw Elizabeth buying lunch at the deli from 5pm to 10pm.\nThe football field was closed after 10pm.\nBetween what times could Elizabeth have gone to the football field?\nOptions:\n(A) 4pm to 5pm\n(B) 5pm to 10pm\n(C) 5am to 9am\n(D) 10am to 2pm", "target": "(A)"}
{"input": "Jason woke up at 7am.\nJessica saw Jason taking photos near the Eiffel Tower from 7am to 8am.\nAndrew saw Jason working at the office from 9am to 5pm.\nSusan saw Jason buying a phone at the electronics store from 5pm to 8pm.\nJohn saw Jason attending class at the school from 8pm to 9pm.\nThe museum was closed after 9pm.\nBetween what times could Jason have gone to the museum?\nOptions:\n(A) 7am to 8am\n(B) 9am to 5pm\n(C) 5pm to 8pm\n(D) 8am to 9am", "target": "(D)"}
{"input": "Linda woke up at 10am.\nElizabeth saw Linda waiting at the train station from 10am to 12pm.\nDavid saw Linda working at the office from 2pm to 4pm.\nSarah saw Linda waiting at the airport from 4pm to 5pm.\nAshley saw Linda attending class at the school from 5pm to 9pm.\nBetty saw Linda walking in the garden from 9pm to 10pm.\nThe beach was closed after 10pm.\nBetween what times could Linda have gone to the beach?\nOptions:\n(A) 12pm to 2pm\n(B) 10am to 12pm\n(C) 2pm to 4pm\n(D) 4pm to 5pm", "target": "(A)"}
{"input": "Anthony woke up at 8am.\nWilliam saw Anthony driving to the water park from 10am to 12pm.\nDavid saw Anthony sitting on a rooftop from 12pm to 1pm.\nRichard saw Anthony buying a phone at the electronics store from 1pm to 4pm.\nThe dance studio was closed after 4pm.\nBetween what times could Anthony have gone to the dance studio?\nOptions:\n(A) 12pm to 1pm\n(B) 1pm to 4pm\n(C) 8am to 10am\n(D) 10am to 12pm", "target": "(C)"}
{"input": "William woke up at 5am.\nThomas saw William working out at the gym from 5am to 10am.\nLisa saw William taking photos near the Leaning Tower of Pisa from 12pm to 4pm.\nMary saw William sitting on a rooftop from 4pm to 7pm.\nThe orchestra hall was closed after 7pm.\nBetween what times could William have gone to the orchestra hall?\nOptions:\n(A) 10am to 12pm\n(B) 4pm to 7pm\n(C) 12pm to 4pm\n(D) 5am to 10am", "target": "(A)"}
{"input": "Leslie woke up at 7am.\nRichard saw Leslie walking in the garden from 7am to 8am.\nLeslie saw Leslie buying cookies at a bakery from 8am to 9am.\nJason saw Leslie buying a bike at the bike shop from 9am to 10am.\nSamantha saw Leslie taking photos near the Eiffel Tower from 10am to 3pm.\nLinda saw Leslie taking photos near the Leaning Tower of Pisa from 6pm to 8pm.\nThe orchestra hall was closed after 8pm.\nBetween what times could Leslie have gone to the orchestra hall?\nOptions:\n(A) 3pm to 6pm\n(B) 9am to 10am\n(C) 7am to 8am\n(D) 10am to 3pm", "target": "(A)"}
{"input": "Sarah woke up at 6am.\nNancy saw Sarah fixing their computer at the electronic store from 8am to 2pm.\nBetty saw Sarah driving to the water park from 2pm to 3pm.\nKimberly saw Sarah buying clothes at the mall from 3pm to 4pm.\nEmily saw Sarah buying cookies at a bakery from 4pm to 6pm.\nDavid saw Sarah attending class at the school from 6pm to 8pm.\nThe construction site was closed after 8pm.\nBetween what times could Sarah have gone to the construction site?\nOptions:\n(A) 3pm to 4pm\n(B) 2pm to 3pm\n(C) 6am to 8am\n(D) 8am to 2pm", "target": "(C)"}
{"input": "William woke up at 6am.\nWilliam saw William working out at the gym from 6am to 7am.\nSean saw William taking photos near the Eiffel Tower from 9am to 12pm.\nSusan saw William working at the office from 12pm to 8pm.\nNancy saw William buying a bike at the bike shop from 8pm to 10pm.\nThe art studio was closed after 10pm.\nBetween what times could William have gone to the art studio?\nOptions:\n(A) 8pm to 10pm\n(B) 9am to 12pm\n(C) 6am to 7am\n(D) 7am to 9am", "target": "(D)"}
{"input": "Emily woke up at 8am.\nEmily saw Emily taking photos near the Eiffel Tower from 9am to 10am.\nAndrew saw Emily buying clothes at the mall from 10am to 11am.\nLeslie saw Emily sitting on a rooftop from 11am to 1pm.\nLinda saw Emily working at the office from 1pm to 4pm.\nWilliam saw Emily buying a bike at the bike shop from 4pm to 10pm.\nThe construction site was closed after 10pm.\nBetween what times could Emily have gone to the construction site?\nOptions:\n(A) 10am to 11am\n(B) 9am to 10am\n(C) 8am to 9am\n(D) 4pm to 10pm", "target": "(C)"}
{"input": "Richard woke up at 8am.\nBetty saw Richard reading at the library from 9am to 2pm.\nDavid saw Richard fixing their computer at the electronic store from 2pm to 4pm.\nMary saw Richard taking photos near the Eiffel Tower from 4pm to 5pm.\nHannah saw Richard sitting on a rooftop from 5pm to 6pm.\nSusan saw Richard driving to the water park from 6pm to 7pm.\nThe bakery was closed after 7pm.\nBetween what times could Richard have gone to the bakery?\nOptions:\n(A) 6pm to 7pm\n(B) 9am to 2pm\n(C) 5pm to 6pm\n(D) 8am to 9am", "target": "(D)"}
{"input": "Leslie woke up at 5am.\nEmily saw Leslie attending class at the school from 5am to 9am.\nAnthony saw Leslie watching a movie at the theater from 9am to 11am.\nThomas saw Leslie buying cookies at a bakery from 11am to 4pm.\nAshley saw Leslie fixing their computer at the electronic store from 4pm to 5pm.\nSusan saw Leslie walking towards the Statue of Liberty from 9pm to 10pm.\nThe beach was closed after 10pm.\nBetween what times could Leslie have gone to the beach?\nOptions:\n(A) 5pm to 9pm\n(B) 9am to 11am\n(C) 9pm to 10pm\n(D) 4pm to 5pm", "target": "(A)"}
{"input": "Mark woke up at 12pm.\nJames saw Mark buying clothes at the mall from 12pm to 1pm.\nNancy saw Mark driving to the water park from 1pm to 4pm.\nRichard saw Mark sitting on a rooftop from 5pm to 6pm.\nJohn saw Mark getting a coffee at the cafe from 6pm to 10pm.\nThe basketball court was closed after 10pm.\nBetween what times could Mark have gone to the basketball court?\nOptions:\n(A) 5pm to 6pm\n(B) 1pm to 4pm\n(C) 4pm to 5pm\n(D) 12pm to 1pm", "target": "(C)"}
{"input": "Nancy woke up at 8am.\nRichard saw Nancy fixing their computer at the electronic store from 8am to 12pm.\nMark saw Nancy stretching at a yoga studio from 12pm to 2pm.\nNancy saw Nancy working out at the gym from 2pm to 5pm.\nWilliam saw Nancy getting a coffee at the cafe from 5pm to 6pm.\nSteven saw Nancy walking in the garden from 7pm to 9pm.\nThe movies was closed after 9pm.\nBetween what times could Nancy have gone to the movies?\nOptions:\n(A) 6pm to 7pm\n(B) 2pm to 5pm\n(C) 5pm to 6pm\n(D) 7pm to 9pm", "target": "(A)"}
{"input": "Hannah woke up at 6am.\nJames saw Hannah playing tennis at the tennis court from 6am to 10am.\nAnthony saw Hannah walking in the garden from 10am to 11am.\nJennifer saw Hannah waiting at the train station from 11am to 3pm.\nLinda saw Hannah stretching at a yoga studio from 5pm to 8pm.\nKimberly saw Hannah reading at the library from 8pm to 10pm.\nThe basketball court was closed after 10pm.\nBetween what times could Hannah have gone to the basketball court?\nOptions:\n(A) 11am to 3pm\n(B) 10am to 11am\n(C) 8pm to 10pm\n(D) 3pm to 5pm", "target": "(D)"}
{"input": "Tiffany woke up at 6am.\nMichael saw Tiffany buying lunch at the deli from 12pm to 5pm.\nAndrew saw Tiffany playing tennis at the tennis court from 5pm to 6pm.\nJohn saw Tiffany driving to the water park from 6pm to 8pm.\nSarah saw Tiffany watching a movie at the theater from 8pm to 10pm.\nThe clothing store was closed after 10pm.\nBetween what times could Tiffany have gone to the clothing store?\nOptions:\n(A) 5pm to 6pm\n(B) 6pm to 8pm\n(C) 6am to 12pm\n(D) 8pm to 10pm", "target": "(C)"}
{"input": "Sean woke up at 5am.\nEmily saw Sean sitting on a rooftop from 5am to 6am.\nJason saw Sean fixing their computer at the electronic store from 6am to 7am.\nJennifer saw Sean working out at the gym from 7am to 8am.\nDavid saw Sean taking photos near the Leaning Tower of Pisa from 9am to 7pm.\nThe restaurant was closed after 7pm.\nBetween what times could Sean have gone to the restaurant?\nOptions:\n(A) 7am to 8am\n(B) 6am to 7am\n(C) 9am to 7pm\n(D) 8am to 9am", "target": "(D)"}
{"input": "Samantha woke up at 5am.\nLisa saw Samantha driving to the water park from 8am to 12pm.\nMary saw Samantha walking in the garden from 12pm to 4pm.\nSamantha saw Samantha reading at the library from 4pm to 6pm.\nThe movies was closed after 6pm.\nBetween what times could Samantha have gone to the movies?\nOptions:\n(A) 8am to 12pm\n(B) 4pm to 6pm\n(C) 5am to 8am\n(D) 12pm to 4pm", "target": "(C)"}
{"input": "Leslie woke up at 5am.\nBetty saw Leslie walking towards the Statue of Liberty from 5am to 7am.\nMary saw Leslie working out at the gym from 9am to 10am.\nHannah saw Leslie fixing their computer at the electronic store from 10am to 5pm.\nMark saw Leslie attending class at the school from 5pm to 9pm.\nThe physics classroom was closed after 9pm.\nBetween what times could Leslie have gone to the physics classroom?\nOptions:\n(A) 5am to 7am\n(B) 5pm to 9pm\n(C) 7am to 9am\n(D) 9am to 10am", "target": "(C)"}
{"input": "Richard woke up at 5am.\nElizabeth saw Richard taking photos near the Leaning Tower of Pisa from 5am to 7am.\nLisa saw Richard fixing their computer at the electronic store from 3pm to 7pm.\nLeslie saw Richard reading at the library from 7pm to 8pm.\nThe basketball court was closed after 8pm.\nBetween what times could Richard have gone to the basketball court?\nOptions:\n(A) 3pm to 7pm\n(B) 5am to 7am\n(C) 7pm to 8pm\n(D) 7am to 3pm", "target": "(D)"}
{"input": "Hannah woke up at 5am.\nHannah saw Hannah buying a phone at the electronics store from 11am to 2pm.\nAshley saw Hannah taking photos near the Eiffel Tower from 2pm to 3pm.\nNancy saw Hannah buying clothes at the mall from 3pm to 5pm.\nThe bakery was closed after 5pm.\nBetween what times could Hannah have gone to the bakery?\nOptions:\n(A) 2pm to 3pm\n(B) 5am to 11am\n(C) 3pm to 5pm\n(D) 11am to 2pm", "target": "(B)"}
{"input": "David woke up at 9am.\nKimberly saw David working out at the gym from 9am to 10am.\nMichael saw David watching a movie at the theater from 11am to 12pm.\nJennifer saw David attending class at the school from 12pm to 1pm.\nJason saw David buying a phone at the electronics store from 1pm to 2pm.\nWilliam saw David sitting on a rooftop from 2pm to 10pm.\nThe swimming pool was closed after 10pm.\nBetween what times could David have gone to the swimming pool?\nOptions:\n(A) 10am to 11am\n(B) 12pm to 1pm\n(C) 2pm to 10pm\n(D) 9am to 10am", "target": "(A)"}
{"input": "Mary woke up at 9am.\nDavid saw Mary walking in the garden from 9am to 11am.\nSamantha saw Mary getting a coffee at the cafe from 2pm to 3pm.\nSarah saw Mary driving to the water park from 3pm to 7pm.\nThe restaurant was closed after 7pm.\nBetween what times could Mary have gone to the restaurant?\nOptions:\n(A) 3pm to 7pm\n(B) 9am to 11am\n(C) 2pm to 3pm\n(D) 11am to 2pm", "target": "(D)"}
{"input": "Jason woke up at 5am.\nNancy saw Jason buying clothes at the mall from 5am to 2pm.\nEmily saw Jason walking in the garden from 2pm to 4pm.\nJohn saw Jason reading at the library from 5pm to 8pm.\nJennifer saw Jason buying lunch at the deli from 8pm to 9pm.\nThe park was closed after 9pm.\nBetween what times could Jason have gone to the park?\nOptions:\n(A) 5am to 2pm\n(B) 4pm to 5pm\n(C) 2pm to 4pm\n(D) 8pm to 9pm", "target": "(B)"}
{"input": "James woke up at 12pm.\nJohn saw James taking photos near the Leaning Tower of Pisa from 2pm to 4pm.\nWilliam saw James buying a bike at the bike shop from 4pm to 5pm.\nJennifer saw James getting a coffee at the cafe from 5pm to 8pm.\nThe swimming pool was closed after 8pm.\nBetween what times could James have gone to the swimming pool?\nOptions:\n(A) 4pm to 5pm\n(B) 5pm to 8pm\n(C) 12pm to 2pm\n(D) 2pm to 4pm", "target": "(C)"}
{"input": "Susan woke up at 6am.\nSusan saw Susan buying a bike at the bike shop from 11am to 12pm.\nWilliam saw Susan stretching at a yoga studio from 12pm to 4pm.\nDavid saw Susan taking photos near the Eiffel Tower from 4pm to 8pm.\nThe art studio was closed after 8pm.\nBetween what times could Susan have gone to the art studio?\nOptions:\n(A) 11am to 12pm\n(B) 12pm to 4pm\n(C) 6am to 11am\n(D) 4pm to 8pm", "target": "(C)"}
{"input": "Emily woke up at 10am.\nLinda saw Emily waiting at the train station from 10am to 12pm.\nAshley saw Emily fixing their computer at the electronic store from 12pm to 1pm.\nJohn saw Emily walking towards the Statue of Liberty from 1pm to 2pm.\nThe soccer field was closed after 8pm.\nBetween what times could Emily have gone to the soccer field?\nOptions:\n(A) 12pm to 1pm\n(B) 10am to 12pm\n(C) 2pm to 8pm\n(D) 1pm to 2pm", "target": "(C)"}
{"input": "Sarah woke up at 5am.\nSusan saw Sarah buying a phone at the electronics store from 5am to 7am.\nEmily saw Sarah playing tennis at the tennis court from 7am to 11am.\nThomas saw Sarah sitting on a rooftop from 1pm to 6pm.\nThe dance studio was closed after 6pm.\nBetween what times could Sarah have gone to the dance studio?\nOptions:\n(A) 1pm to 6pm\n(B) 7am to 11am\n(C) 5am to 7am\n(D) 11am to 1pm", "target": "(D)"}
{"input": "Jennifer woke up at 5am.\nSteven saw Jennifer stretching at a yoga studio from 5am to 8am.\nRichard saw Jennifer waiting at the train station from 8am to 10am.\nMark saw Jennifer walking in the garden from 12pm to 7pm.\nThe coffee shop was closed after 7pm.\nBetween what times could Jennifer have gone to the coffee shop?\nOptions:\n(A) 10am to 12pm\n(B) 5am to 8am\n(C) 8am to 10am\n(D) 12pm to 7pm", "target": "(A)"}
{"input": "Susan woke up at 7am.\nMary saw Susan fixing their computer at the electronic store from 1pm to 2pm.\nMichael saw Susan getting a coffee at the cafe from 2pm to 3pm.\nRichard saw Susan waiting at the train station from 3pm to 5pm.\nLinda saw Susan taking photos near the Eiffel Tower from 5pm to 6pm.\nThe park was closed after 6pm.\nBetween what times could Susan have gone to the park?\nOptions:\n(A) 5pm to 6pm\n(B) 3pm to 5pm\n(C) 7am to 1pm\n(D) 2pm to 3pm", "target": "(C)"}
{"input": "David woke up at 5am.\nSarah saw David reading at the library from 5am to 7am.\nJohn saw David fixing their computer at the electronic store from 7am to 10am.\nTiffany saw David buying a bike at the bike shop from 10am to 12pm.\nWilliam saw David buying a phone at the electronics store from 7pm to 10pm.\nThe market was closed after 10pm.\nBetween what times could David have gone to the market?\nOptions:\n(A) 12pm to 7pm\n(B) 7pm to 10pm\n(C) 7am to 10am\n(D) 10am to 12pm", "target": "(A)"}
{"input": "Michael woke up at 6am.\nLinda saw Michael walking towards the Statue of Liberty from 11am to 12pm.\nBetty saw Michael reading at the library from 12pm to 5pm.\nSteven saw Michael taking photos near the Eiffel Tower from 5pm to 7pm.\nDavid saw Michael getting a coffee at the cafe from 7pm to 8pm.\nThe park was closed after 8pm.\nBetween what times could Michael have gone to the park?\nOptions:\n(A) 6am to 11am\n(B) 12pm to 5pm\n(C) 5pm to 7pm\n(D) 11am to 12pm", "target": "(A)"}
{"input": "Mark woke up at 10am.\nBetty saw Mark buying a bike at the bike shop from 10am to 11am.\nAshley saw Mark watching a movie at the theater from 1pm to 2pm.\nLinda saw Mark working out at the gym from 2pm to 4pm.\nLeslie saw Mark buying a phone at the electronics store from 4pm to 9pm.\nMichael saw Mark waiting at the airport from 9pm to 10pm.\nThe art show was closed after 10pm.\nBetween what times could Mark have gone to the art show?\nOptions:\n(A) 11am to 1pm\n(B) 4pm to 9pm\n(C) 10am to 11am\n(D) 2pm to 4pm", "target": "(A)"}
{"input": "Jason woke up at 5am.\nLeslie saw Jason buying a bike at the bike shop from 5am to 9am.\nJames saw Jason stretching at a yoga studio from 1pm to 8pm.\nWilliam saw Jason taking photos near the Leaning Tower of Pisa from 8pm to 9pm.\nRichard saw Jason getting a coffee at the cafe from 9pm to 10pm.\nThe physics classroom was closed after 10pm.\nBetween what times could Jason have gone to the physics classroom?\nOptions:\n(A) 5am to 9am\n(B) 9am to 1pm\n(C) 1pm to 8pm\n(D) 8pm to 9pm", "target": "(B)"}
{"input": "Andrew woke up at 8am.\nElizabeth saw Andrew fixing their computer at the electronic store from 11am to 3pm.\nJennifer saw Andrew buying a bike at the bike shop from 3pm to 4pm.\nAnthony saw Andrew buying cookies at a bakery from 4pm to 6pm.\nBetty saw Andrew watching a movie at the theater from 6pm to 8pm.\nThe coffee shop was closed after 8pm.\nBetween what times could Andrew have gone to the coffee shop?\nOptions:\n(A) 3pm to 4pm\n(B) 6pm to 8pm\n(C) 8am to 11am\n(D) 11am to 3pm", "target": "(C)"}
{"input": "William woke up at 6am.\nDavid saw William waiting at the airport from 8am to 9am.\nMichael saw William attending class at the school from 9am to 1pm.\nSarah saw William working out at the gym from 1pm to 2pm.\nJessica saw William taking photos near the Eiffel Tower from 2pm to 9pm.\nThe bakery was closed after 9pm.\nBetween what times could William have gone to the bakery?\nOptions:\n(A) 1pm to 2pm\n(B) 8am to 9am\n(C) 9am to 1pm\n(D) 6am to 8am", "target": "(D)"}
{"input": "Emily woke up at 5am.\nLeslie saw Emily getting a coffee at the cafe from 5am to 6am.\nKimberly saw Emily walking towards the Statue of Liberty from 6am to 2pm.\nRichard saw Emily waiting at the airport from 4pm to 10pm.\nThe park was closed after 10pm.\nBetween what times could Emily have gone to the park?\nOptions:\n(A) 6am to 2pm\n(B) 4pm to 10pm\n(C) 5am to 6am\n(D) 2pm to 4pm", "target": "(D)"}
{"input": "Sarah woke up at 10am.\nAnthony saw Sarah getting a coffee at the cafe from 11am to 12pm.\nAndrew saw Sarah buying a phone at the electronics store from 12pm to 2pm.\nKimberly saw Sarah driving to the water park from 2pm to 7pm.\nSarah saw Sarah attending class at the school from 7pm to 8pm.\nJennifer saw Sarah watching a movie at the theater from 8pm to 10pm.\nThe amusement park was closed after 10pm.\nBetween what times could Sarah have gone to the amusement park?\nOptions:\n(A) 2pm to 7pm\n(B) 12pm to 2pm\n(C) 10am to 11am\n(D) 7pm to 8pm", "target": "(C)"}
{"input": "Jennifer woke up at 5am.\nRichard saw Jennifer working at the office from 5am to 8am.\nSamantha saw Jennifer reading at the library from 12pm to 1pm.\nBetty saw Jennifer buying a bike at the bike shop from 1pm to 2pm.\nSarah saw Jennifer buying a phone at the electronics store from 2pm to 9pm.\nThomas saw Jennifer walking towards the Statue of Liberty from 9pm to 10pm.\nThe swimming pool was closed after 10pm.\nBetween what times could Jennifer have gone to the swimming pool?\nOptions:\n(A) 8am to 12pm\n(B) 9pm to 10pm\n(C) 2pm to 9pm\n(D) 12pm to 1pm", "target": "(A)"}
